# CreateOpenGLHandle

## Description
Return a new OpenGL options handle.

```pascal
PROCEDURE CreateOpenGLHandle(VAR GLHandle : HANDLE);
```

```python
def vs.CreateOpenGLHandle():
    return GLHandle
```

## Parameters
|Name|Type|Description|
|---|---|---|
|GLHandle|HANDLE|   |

## Examples
```pascal
CreateOpenGLHandle(GLHandle);
```
```python
import vs

# Return a new OpenGL options handle.
objHandle = vs.CreateOpenGLHandle()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## Version
Availability: from Vectorworks 2014

## Category
* View @ Zoom